HloModule tiled_matmul_ws_perf_256x256, entry_computation_layout={(bf16[256,64]{1,0}, bf16[64,256]{1,0})->bf16[256,256]{1,0}}

ENTRY main {
  %lhs = bf16[256,64] parameter(0)
  %rhs = bf16[64,256] parameter(1)
  ROOT %out = bf16[256,256] dot(%lhs, %rhs), lhs_contracting_dims={1}, rhs_contracting_dims={0}
}
